<!DOCTYPE html>
<html lang="en-us">
  <head>
    <meta charset="UTF-8">
    <title>Ferramentas de Bioinformática</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="stylesheet" type="text/css" href="stylesheets/normalize.css" media="screen">
    <link href='https://fonts.googleapis.com/css?family=Open+Sans:400,700' rel='stylesheet' type='text/css'>
    <link rel="stylesheet" type="text/css" href="stylesheets/stylesheet.css" media="screen">
    <link rel="stylesheet" type="text/css" href="stylesheets/github-light.css" media="screen">
  </head>
  <body>
    <section class="page-header">
      <h1 class="project-name">Ferramentas de Bioinformática</h1>
      <h2 class="project-tagline">Lista de ferramentas utilizadas no ensino de Bioinformática</h2>
      <a href="https://ferramentas-bio.github.io/material-artigo" class="btn">Home</a>
      <a href="https://ferramentas-bio.github.io/material-artigo/classificacao.html" class="btn">Classificação</a>
      <a href="https://ferramentas-bio.github.io/material-artigo/ferramentas.html" class="btn">Ferramentas</a>
      <a href="https://ferramentas-bio.github.io/material-artigo/tutoriais.html" class="btn">Tutoriais</a>
      <a href="https://ferramentas-bio.github.io/material-artigo/referencias.html" class="btn">Referências</a>
    </section>

    <section class="main-content">
<h2>Portal</h2>
<h3>NCBI - <em>National Center for Biotechnology Information</em> (F01)</h3>
<p>A primeira ferramenta que &eacute; apresentada a partir dessa conceitua&ccedil;&atilde;o inicial &eacute; o Portal do NCBI. Sendo um recurso global para informa&ccedil;&otilde;es em biologia molecular, a miss&atilde;o do NCBI &eacute; desenvolver novas tecnologias de informa&ccedil;&atilde;o para ajudar na compreens&atilde;o dos processos moleculares e gen&eacute;ticos fundamentais que controlam a sa&uacute;de e a doen&ccedil;a. Mais especificamente, o NCBI foi encarregado de criar sistemas automatizados para armazenar e analisar bases de dados de biologia molecular, bioqu&iacute;mica e gen&eacute;tica; facilitando o uso de tais bases de dados e software pelas comunidades m&eacute;dica e de&nbsp; pesquisa; coordenar esfor&ccedil;os para reunir informa&ccedil;&otilde;es de biotecnologia nacional e internacionalmente; e realizando a investiga&ccedil;&atilde;o de m&eacute;todos avan&ccedil;ados de processamento de informa&ccedil;&atilde;o baseado em computador para analisar a estrutura e fun&ccedil;&atilde;o de mol&eacute;culas biologicamente importantes.</p>
<p>A partir dele, o primeiro banco de dados biol&oacute;gicos com as sequ&ecirc;ncias &eacute; demonstrado. O NCBI &eacute; apresentado na Unidade I.</p>
<h2>Bancos de Dados de Macromol&eacute;culas:</h2>
<p>De acordo com a Enciclop&eacute;dia <em>Wiley</em> (<em>Wiley Encyclopedia of Computer Science and Engineering</em>, 2008), no verbete <em>Bioinformatic Databases</em> (Bancos de Dados de Bioinform&aacute;tica), um banco de dados &eacute; um reposit&oacute;rio de dados inter-relacionados, projetado para suprir as necessidades de um grupo espec&iacute;fico de aplica&ccedil;&otilde;es e usu&aacute;rios. Contudo, na Bioinform&aacute;tica, as informa&ccedil;&otilde;es a serem armazenadas nem sempre s&atilde;o facilmente representadas por meio de um modelo relacional, bem como os tipos de consultas que precisam ser realizados n&atilde;o s&atilde;o convencionais. Por isto, o conceito de Bancos de Dados de Bioinform&aacute;tica vai al&eacute;m e envolve tanto o armazenamento quanto os m&eacute;todos de manuten&ccedil;&atilde;o, extra&ccedil;&atilde;o e visualiza&ccedil;&atilde;o da informa&ccedil;&atilde;o <em>(Wiley Encyclopedia of Computer Science and Engineering</em>, 2008). Um exemplo desta caracter&iacute;stica &eacute; o banco de dados de estruturas de macromol&eacute;culas biol&oacute;gicas - PDB (<em>The Protein Data Bank</em>), que armazena os dados em arquivos texto em um sistema de arquivos (Bernstein et al., 1977). &nbsp;&nbsp;&nbsp;&nbsp;Os bancos de dados s&atilde;o apresentados na Unidade I. Os principais bancos de dados trabalhados nesta unidade s&atilde;o o <em>GenBank</em> e o RCSB <em>Protein Data Bank.</em></p>
<h3>GenBank (F02)</h3>
<p>O GenBank &eacute; um banco de dados p&uacute;blico de todos os nucleot&iacute;deos e estruturas de prote&iacute;nas conhecidos, com suporte bibliogr&aacute;fico e anota&ccedil;&otilde;es biol&oacute;gicas. Ele &eacute; mantido pelo NCBI (<em>National Center for Biotechnology Information</em>), uma divis&atilde;o da NLM (National Library of Medicine), localizada no campus do NIH (US <em>National Institutes of Health</em>) (Benson et al., 2000).</p>
<p>O GenBank recebe submiss&otilde;es de sequ&ecirc;ncias de diversas fontes: autores individuais, grandes grupos de pesquisa, empresas, Escrit&oacute;rio de Patentes dos Estados Unidos, e de outros bancos de dados como o EBI e DDBJ. Esses dados s&atilde;o mantidos pelo NCBI e disponibilizados ao p&uacute;blico em geral atrav&eacute;s da internet por meio de FTP, p&aacute;ginas web e um vasto conjunto de servi&ccedil;os de consulta, sem nenhum custo. Por estas caracter&iacute;sticas, o GenBank foi escolhido pelo professor e &eacute; utilizado nas Unidades I e II.</p>
<h3>RCSB PDB - <em>Protein Data Bank</em> (F03)</h3>
<p>Para verificar a enorme e crescente quantidade de dados referente &agrave;s prote&iacute;nas o pr&oacute;ximo passo &eacute; o <em>RCSB Protein Data Bank</em> (Berman et al., 2000). O PDB &eacute; um banco de dados reconhecido mundialmente que recebe, processa e disponibiliza informa&ccedil;&otilde;es estruturais sobre mol&eacute;culas biol&oacute;gicas, principalmente prote&iacute;nas, de forma gratuita para toda comunidade cient&iacute;fica. Por meio do PDB os alunos obt&eacute;m as estruturas que ser&atilde;o visualizadas e manipuladas nas pr&oacute;ximas unidades. A primeira visualiza&ccedil;&atilde;o de uma prote&iacute;na &eacute; realizada diretamente na interface online do PDB, atrav&eacute;s de seu visualizador PyMol. O RCSB PDB permite a busca de prote&iacute;nas por meio de um identificador &uacute;nico, o PDB ID, por autor, macromol&eacute;cula, sequ&ecirc;ncia ou ligante. Tamb&eacute;m &eacute; poss&iacute;vel realizar analises diretamente na interface, como alinhamento de sequ&ecirc;ncias e estruturas. Al&eacute;m disso o PDB tem um ambiente de aprendizagem p&uacute;blico, o PDB101, onde professores, estudantes e p&uacute;blico em geral podem explorar conte&uacute;dos sobre prote&iacute;nas e &aacute;cidos nucleicos.</p>
<p>Existem outros bancos de dados que armazenam informa&ccedil;&otilde;es sobre prote&iacute;nas, tais como o UniProt. No entanto, para o objetivo das aulas, que &eacute; ensinar a pesquisar e recuperar os arquivos de estruturas, o PDB apresenta a melhor interface de pesquisa. Com ele &eacute; poss&iacute;vel pesquisar as prote&iacute;nas por um identificador &uacute;nico. Ele &eacute; utilizado nas Unidades I e II.</p>
<h3>DDBJ - <em>DNA DataBank of Japan</em> (F07)</h3>
<p>O DDBJ est&aacute; em atividade desde 1986, em conjunto com o GenBank e EMBL. Ele &eacute; parte do NIG (<em>National Institute of Genetics</em>) do Jap&atilde;o, que &eacute; gerenciado pelo Minist&eacute;rio da Educa&ccedil;&atilde;o, Ci&ecirc;ncia e Esportes. Atualmente, o DDBJ &eacute; mantido pelo CIB (<em>Center for Information Biology</em>) e seus quatro laborat&oacute;rios de pesquisa (Tateno and Gojobori, 1997).</p>
<p>&nbsp;O DDBJ prov&ecirc; basicamente sequ&ecirc;ncias de DNA, bem como recebe submiss&otilde;es de sequ&ecirc;ncias: inicialmente, atrav&eacute;s de disquetes (<em>floppy disks</em>) e recentemente utilizando a internet. &Eacute; importante salientar uma pequena diferen&ccedil;a do DDBJ em rela&ccedil;&atilde;o aos outros bancos de dados j&aacute; citados: ele utiliza para armazenamento um banco de dados que segue o modelo objeto-relacional, e n&atilde;o o modelo relacional (Tateno and Gojobori, 1997). A diferen&ccedil;a reside na estrutura&ccedil;&atilde;o da informa&ccedil;&atilde;o para consulta: o modelo objeto-relacional permite que toda a informa&ccedil;&atilde;o inter-relacionada seja consultada como se fosse uma unidade, enquanto o modelo relacional precisa especificar cada entidade e explicitar o relacionamento entre as mesmas para produzir uma consulta. Isso traz algumas vantagens no momento em que a informa&ccedil;&atilde;o recebida &eacute; naturalmente armazenada e n&atilde;o requer tanta transforma&ccedil;&atilde;o.</p>
<p>O DDBJ tamb&eacute;m prov&ecirc; uma s&eacute;rie de maneiras diferentes para os usu&aacute;rios recuperarem a informa&ccedil;&atilde;o armazenada. S&atilde;o interfaces web ou aplicativos, alguns gerais, outros espec&iacute;ficos para certos formatos de informa&ccedil;&atilde;o (Tateno and Gojobori, 1997).</p>
<p>Al&eacute;m disso, o DDBJ suporta outros bancos de dados secund&aacute;rios, provendo informa&ccedil;&atilde;o para os mesmos procederem com suas pesquisas e enriquecer a informa&ccedil;&atilde;o existente.</p>
<h3>CATH - <em>Class, Architecture, Topology, Homology</em> (F05)</h3>
<p>O CATH &eacute; um banco de dados que cont&eacute;m a classifica&ccedil;&atilde;o (de mesmo nome) de estruturas de prote&iacute;nas baixados do Protein Data Bank. O CATH agrupa dom&iacute;nios proteicos em superfam&iacute;lias, quando existam provas suficientes de que eles divergiram de um ancestral comum.</p>
<h3>SCOP - <em>Structural Classification of Proteins</em> (F06)</h3>
<p>A base de dados SCOP (classifica&ccedil;&atilde;o estrutural de prote&iacute;nas) &eacute; uma classifica&ccedil;&atilde;o global de todas as prote&iacute;nas com estrutura conhecida, de acordo com as suas rela&ccedil;&otilde;es evolutivas e estruturais.</p>
<h2>Aplicativos/Algoritmos</h2>
<h3>BLAST - <em>Basic Local Alignment Search Tool</em> (F21)</h3>
<p>O BLAST &eacute; uma ferramenta que encontra regi&otilde;es de similaridade local entre sequ&ecirc;ncias. O programa compara as sequ&ecirc;ncias de nucleot&iacute;deos ou prote&iacute;nas contra as bases de dados do NCBI e calcula a signific&acirc;ncia estat&iacute;stica das similaridades encontradas. BLAST pode ser usado para inferir rela&ccedil;&otilde;es funcionais e evolutivas entre sequ&ecirc;ncias, bem como ajudar a identificar os membros de fam&iacute;lias de genes.</p>
<p>A ferramenta BLAST &eacute; uma ferramenta muito utilizada dentro da bioinform&aacute;tica por ser uma ferramenta muito r&aacute;pida e existirem diversas varia&ccedil;&otilde;es do BLAST, cada uma com um objetivo espec&iacute;fico. Esse conjunto de varia&ccedil;&otilde;es de programas do pacote BLAST pode ser chamado de fam&iacute;lia BLAST. Existem outras ferramentas, como o Mega, que permitem executar Pesquisas Blast, mas elas utilizam as ferramentas do NCBI para a tarefa, devido ao acesso a base de dados do NCBI, que &eacute; hoje a refer&ecirc;ncia para bancos de dados de sequ&ecirc;ncias. Por esse motivo e sua facilidade de uso, o BLAST, em sua interface web atrav&eacute;s do Portal NCBI, &eacute; abordado nas unidades III e IV.</p>
<h3>Swiss-PdbViewer (DeepView)(F13)</h3>
<p>Os visualizadores moleculares podem ser <em>online</em> e <em>offline</em>. Os visualizadores <em>offline</em> permitem mais controle para visualiza&ccedil;&atilde;o. Nas aulas o professor utiliza o Pymol (online) no pr&oacute;prio PDB para dar uma vis&atilde;o geral das estruturas de prote&iacute;nas. Depois para visualizar a estrutura mais detalhadamente e realizar an&aacute;lises, &eacute; Swiss-PdbViewer &eacute; mais adequado.</p>
<p>&Eacute; um programa de visualiza&ccedil;&atilde;o molecular que fornece ferramentas para constru&ccedil;&atilde;o de modelos b&aacute;sicos. A escolha deste software &eacute; justificada pela facilidade de uso e a curva de aprendizagem r&aacute;pida, pois sua interface &eacute; amig&aacute;vel e intuitiva. Al&eacute;m disso possui outros recursos, como a op&ccedil;&atilde;o de sobrepor dois ou mais modelos de estruturas de prote&iacute;nas.</p>
<h3>ClustalW/X (F22)</h3>
<p>Alinhamentos m&uacute;ltiplos de sequ&ecirc;ncias s&atilde;o agora uma das an&aacute;lises de bioinform&aacute;tica mais utilizadas. Eles s&atilde;o necess&aacute;rias rotineiramente como partes de an&aacute;lises mais complexas ou pipelines de an&aacute;lise e existem v&aacute;rios pacotes muito utilizados, por exemplo, Clustal W (Thompson et al., 1994), Clustal X (Thompson et al., 1997), T-Coffee (Chang et al., 2014), MAFFT (Katoh et al., 2002) e MUSCLE (Edgar, 2004). Na disciplina, a ferramenta ClustalW dispon&iacute;vel no EBI &eacute; utilizada na Unidade IV, devido a sua facilidade (curva de aprendizado simplificada) e disponibilidade via Web. Poderia ser utilizada sua vers&atilde;o <em>desktop</em>, o ClustalX, mas para facilitar para os alunos e n&atilde;o perder tempo com detalhes de instala&ccedil;&atilde;o, costuma-se usar o ClustalW.</p>
<h3>ProSite Scan (F26)</h3>
<p>PROSITE &eacute; um banco de dados de fam&iacute;lias de prote&iacute;nas e dom&iacute;nios. Baseia-se na observa&ccedil;&atilde;o de que, quando existe um grande n&uacute;mero de prote&iacute;nas diferentes, a maioria deles podem ser agrupados, com base em semelhan&ccedil;as nas suas sequ&ecirc;ncias, para um n&uacute;mero limitado de fam&iacute;lias. As prote&iacute;nas ou dom&iacute;nios proteicos pertencentes a uma fam&iacute;lia particular, geralmente partilham atributos funcionais e s&atilde;o derivados a partir de um antepassado comum. PROSITE atualmente cont&eacute;m padr&otilde;es e perfis espec&iacute;ficos para mais de mil fam&iacute;lias de prote&iacute;nas ou dom&iacute;nios. Cada uma destas assinaturas vem com documenta&ccedil;&atilde;o fornecendo informa&ccedil;&otilde;es b&aacute;sicas sobre a estrutura e fun&ccedil;&atilde;o destas prote&iacute;nas.</p>
<h3>PSIPred (F31)</h3>
<p>O servidor de predi&ccedil;&atilde;o de estrutura de prote&iacute;nas PSIPRED permite aos usu&aacute;rios enviar uma sequ&ecirc;ncia de prote&iacute;na, executar a predi&ccedil;&atilde;o com o m&eacute;todo de sua escolha e receber os resultados da previs&atilde;o, tanto textualmente via e-mail quanto graficamente atrav&eacute;s da web. O usu&aacute;rio pode selecionar um dos tr&ecirc;s m&eacute;todos de previs&atilde;o para aplicar a sua sequ&ecirc;ncia: PSIPRED, um m&eacute;todo de previs&atilde;o de estrutura secund&aacute;ria de alta precis&atilde;o; MEMSAT 2, uma nova vers&atilde;o de um m&eacute;todo de predi&ccedil;&atilde;o de topologia transmembrana amplamente utilizado; ou <em>GenTHREADER</em>, um m&eacute;todo de reconhecimento de dobras com base no perfil da sequ&ecirc;ncia. Existem dois servidores principais para utiliza&ccedil;&atilde;o do PSIPred: um na UCL (<em>University College London</em>) - UK e outro no NCBI. Na disciplina, o PSIPred &eacute; uma das ferramentas utilizadas na Unidade V, atrav&eacute;s do Portal do NCBI.</p>
<h3>MODELLER (F32)</h3>
<p>O Modeller &eacute; uma ferramenta de Predi&ccedil;&atilde;o de Estrutura Tridimensional de Prote&iacute;nas que utiliza o m&eacute;todo de modelagem comparativa ou por homologia. S&atilde;o fornecidas duas sequ&ecirc;ncias de prote&iacute;nas alinhadas, uma da prote&iacute;na com estrutura desconhecida e uma estrutura modelo para que o Modeller fa&ccedil;a a predi&ccedil;&atilde;o, calculando automaticamente um modelo que cont&eacute;m todos os &aacute;tomos que n&atilde;o sejam hidrog&eacute;nio. Ele implementa a modelagem da estrutura de prote&iacute;nas comparativa pela satisfa&ccedil;&atilde;o de restri&ccedil;&otilde;es espaciais, e pode executar muitas tarefas adicionais, incluindo de modelagem de novo dos loops em estruturas de prote&iacute;nas, otimiza&ccedil;&atilde;o de v&aacute;rios modelos de estrutura da prote&iacute;na em rela&ccedil;&atilde;o a uma fun&ccedil;&atilde;o objetivo flex&iacute;vel, alinhamento m&uacute;ltiplo de sequ&ecirc;ncias de prote&iacute;nas e / ou estruturas, clustering, pesquisa em bases de dados de sequ&ecirc;ncias, a compara&ccedil;&atilde;o das estruturas de prote&iacute;nas, etc. O MODELLER est&aacute; dispon&iacute;vel para download para a maioria dos sistemas Unix / Linux, Windows e Mac. Ele &eacute; utilizado na Unidade V.</p>
<h3>Swiss-Model (F33)</h3>
<p>SWISS-model &eacute; um servidor de modelagem por homologia de estruturas de prote&iacute;nas totalmente automatizado, acess&iacute;vel atrav&eacute;s do servidor web ExPASy, ou a partir do programa DeepView (Swiss PDB-Viewer). O objetivo do servidor web &eacute; fazer com que a modelagem de prote&iacute;nas seja acess&iacute;vel a todos os bioqu&iacute;micos e bi&oacute;logos moleculares em todo o mundo. Como &eacute; acessado atrav&eacute;s do Swiss PDB Viewer, sua utiliza&ccedil;&atilde;o em sala de aula &eacute; mais frequente. Ele &eacute; utilizado na Unidade V.</p>
      <footer class="site-footer">
        <span class="site-footer-owner"><a href="https://github.com/ferramentas-bio/material-artigo">Ferramentas de Bioinformática</a> is maintained by <a href="https://github.com/ferramentas-bio">ferramentas-bio</a>.</span>

        <span class="site-footer-credits">This page was generated by <a href="https://pages.github.com">GitHub Pages</a> using the <a href="https://github.com/jasonlong/cayman-theme">Cayman theme</a> by <a href="https://twitter.com/jasonlong">Jason Long</a>.</span>
      </footer>
    </section>
  </body>
</html>
